# lst = [
    
#     "三年",
#     "四年",
#     "五年",
#     "六年",
#     "七年",
#     "八年",
#     "九年",
#     "十年",
#     "十有一年",
#     "十有二年",
#     "十有三年",
#     "十有四年",
#     "十有五年",
#     "十有六年",
#     "十有七年",
#     "十有八年",
#     "十有九年",
#     "二十年",
#     "二十有一年",
#     "二十有二年",
#     "二十有三年",
#     "二十有四年",
#     "二十有五年",
#     "二十有六年",
#     "二十有七年",
#     "二十有八年",
#     "二十有九年",
#     "三十年",
#     "三十有一年",
#     "三十有二年",
#     "三十有三年",
#     "三十有四年",
#     "三十有五年",
#     "三十有六年",
#     "三十有七年",
#     "三十有八年",
#     "三十有九年",
#     "四十年",
#     "四十有一年",
#     "四十有二年",
#     "四十有三年",
#     "四十有四年",
#     "四十有五年",
#     "四十有六年",
#     "四十有七年",
#     "四十有八年",
#     "四十有九年",
#     "五十年",
#     "五十有一年",
#     "五十有二年",
#     "五十有三年",
#     "五十有四年",
#     "五十有五年",
#     "五十有六年",
#     "五十有七年",
#     "五十有八年",
#     "五十有九年",
#     "六十年",
#     "六十有一年",
#     "六十有二年",
#     "六十有三年",
#     "六十有四年",
#     "六十有五年",
#     "六十有六年",
#     "六十有七年",
#     "六十有八年",
#     "六十有九年",
#     "七十年",
#     "七十有一年",
#     "七十有二年",
#     "七十有三年",
# ]
# s = ''
# for i in lst:
#     with open(f"{i}.md",'w',encoding="utf-8") as f:
#         f.write(f"---\ntitle: {i} - 中华人民共和国史\n---\n# {i}\n")
    
# print(s)

# for i in range(1949,2022):
#     with open(f"{i}年.md",'w',encoding="utf-8") as f:
#         f.write(f"---\ntitle: 建国{i-1949}年 - 公元{i}年 - 中华人民共和国史\n---\n\n# 建国{i-1949}年 - 公元{i}年\n\n")

with open("index.md",'w',encoding="utf-8") as f:
    f.write(f"---\ntitle: 中华人民共和国史\n---\n\n# 中华人民共和国史\n\n")
    for i in range(1949,2022):
        f.write(f"+ [建国{i-1949}年 - 公元{i}年]({i}年.html \"建国{i-1949}年 - 公元{i}年\")\n")
